// قبل ما نبلش حل اخر تكليف حابب هيك قلك كلمة ... الله يعطيك العافية و يوفقك و يرضى عليك برافو يا وحش و انت وصلت لمكان كويس انت قطعت اكتر من ثمانين بالمية من الطريق و بقي عليك القليل 
// انا بعرف انك قدا و بعرف انك رح تلاقي الشغل الي رح يقويلك السي في و بعرف انك ما رح تستسلم و ما عم احكي هون شي مشان اكد انو تكمل او كذا لانو بعرف انك بعون الله و باذن الله مو بحاجة
// بس بكل شغلة بتنعمل سواء كان كتاب بينقرأ او اي شي المفروض تلاقي باخرتو شي للقارئ لدعمه و لشكره على وقته و التقدم الذي احرزه
// ختام الحكي تذكر انو ما النصر الا صبر ساعه ... و اتكل على الله دائما و ابدا و كن مع الله يكون معك و يكون لك نعم المعين
// و الله العلي العظيم ولي التوفيق
function createStars(num) {
    // Your Code Here
    let result = "";
    let ress = "";
    for (let i = num ; i > 0 ; i--) {
        result += " ".repeat(num - i) + "*".repeat(i * 2 - 1) + "\n";
        ress += " ".repeat(i - 1) + "*".repeat((num - i + 1) * 2 - 1) + "\n";
    }
    return result + ress;
}

console.log(createStars(6));

// Output Needed
// ***********
//  *********
//   *******
//    *****
//     ***
//      *
//      *
//     ***
//    *****
//   *******
//  *********
// ***********